Repository: ManhPC/MobileApp
Catalog: lib/l10n/app_*.arb
Languages: vi

# not_selected_stock_code
source: You have not selected a stock code
vi: Bạn chưa chọn mã chứng khoán

# purchasing_ability
source: BP:
vi: SM:

# lang
source: Language
vi: Ngôn ngữ

source: Language
vi: Ngôn ngữ

# loginForm
source: {loginForm, select, title{Login} create_account{Register} account{Don't have an account yet?} user_name{User name} password{Password} save_login{Save login} forgot_password{Forgot password ?} search_stk{Search account} save_login_info{Remember} other{}}
vi: {loginForm, select, title{Đăng nhập} create_account{Mở tài khoản} account{Bạn chưa có tài khoản?} user_name{Tài khoản} password{Mật khẩu} save_login{Lưu đăng nhập} forgot_password{Quên mật khẩu?} search_stk{Tra cứu số tài khoản} save_login_info{Lưu thông tin đăng nhập} other{}}

# hintSearch
source: Search...
vi: Tìm kiếm...

# searchAccount
source: {searchAccount,select, searchaccount{Search for account number} message{Please enter complete information below to search for account number} idcard{ID card number} phone{Phone number} button{Search} accountnumber{Your account number} accountname{Account holder's name} other{}}
vi: {searchAccount,select, searchaccount{Tra cứu số tài khoản} message{Quý khách vui lòng nhập đầy đủ thông tin dưới đây để tra cứu số tài khoản} idcard{Số CCCD/CMND} phone{Số điện thoại} button{Tra cứu} accountnumber{Số tài khoản của quý khách} accountname{Họ tên chủ tài khoản} other{}}

# forgetPassword
source: {forgetPassword, select, forgotpassword{Forgot Password} accountnumber{Account number} idcard{Identification code} resetpass{Reset Password} newpass{New password} enternewpass{Enter new password} renewpass{Re-enter new password} enterrenewpass{Please re-enter new password} msg{Login password must have:} check1{Length of 8-32 characters.} check2{Include uppercase, lowercase, numbers, and special characters.} check3{Exclude spaces.} other{}}
vi: {forgetPassword, select, forgotpassword{Quên mật khẩu} accountnumber{Số tài khoản} idcard{Mã định danh} resetpass{Đặt lại mật khẩu} newpass{Mật khẩu mới} enternewpass{Nhập mật khẩu mới} renewpass{Nhập lại mật khẩu mới} enterrenewpass{Vui lòng nhập lại mật khẩu mới} msg{Mật khẩu đăng nhập phải có:} check1{Độ dài gồm 8-32 ký tự.} check2{Bao gồm chữ hoa, chữ thường, số và ký tự đặc biệt.} check3{Không bao gồm khoảng trắng.} other{}}

# bottombarForm
source: {bottombarForm,select, home{Home} market{Market} order{Order} asset{Assets} orderbook{Order book} expand{Expand} other{}}
vi: {bottombarForm,select, home{Trang chủ} market{Thị trường} order{Đặt lệnh} asset{Tài sản} orderbook{Sổ lệnh} expand{Mở rộng} other{}}

# homepageForm
source: {homepageForm,select,bill{Bil} all{All} watchlist{Watchlist} equitySecure{Equity securities} stock{Stock} industry{Industry} waranties{Waranties} symbol{Symbol} matchPrice{Match price} matchvol{Match vol} totalvol{Total vol} addnewWL{Add new watchlist} other{}}
vi: {homepageForm,select,bill{Tỷ} all{Tất cả} watchlist{Danh mục} equitySecure{Chứng khoán sở hữu} stock{Cổ phiếu} industry{Ngành} waranties{Chứng quyền} symbol{Mã CK} matchPrice{Giá khớp} matchvol{KL khớp} totalvol{Tổng KL} addnewWL{Thêm danh mục mới} other{}}

# addCommandForm
source: {addCommandForm,select,order{Order} floor{Floor} tc{Ref} ceil{Ceil} highest{Highest} lowest{Lowest} avg{Avg} totalvol{Tot√°l vol} Bvol{Buy vol} Svol{Sell vol} Bpri{Buy price} Spri{Sell price} volume{Volume} maxQuan{Maximum quantity} price{Price} stoplossprice{Stop loss price} takeprofitprice{Take profit price} SLs{SL slippage} activationprice{Activation price} slippage{Slippage} pricerange{Price range} startDate{Start date} endDate{End date} buyingPower{Buying power} loanRatio{Loan ratio} totalordervalue{Total order value} other{}}
vi: {addCommandForm,select,order{Đặt lệnh} floor{Sàn} tc{TC} ceil{Trần} highest{Cao} lowest{Thấp} avg{TB} totalvol{Tổng KL} Bvol{KL mua} Svol{KL bán} Bpri{Giá mua} Spri{Giá bán} volume{Khối lượng} maxQuan{KL tối đa} price{Giá đặt} stoplossprice{Giá cắt lỗ} takeprofitprice{Giá chốt lãi} SLs{Biên độ cắt lỗ} activationprice{Giá kích hoạt} slippage{Biên trượt} pricerange{Biên độ giá} startDate{Ngày bắt đầu} endDate{Ngày kết thúc} buyingPower{Sức mua} loanRatio{Tỉ lệ cho vay} totalordervalue{Tổng giá trị lệnh} other{}}

# assetPageForm
source: {assetPageForm,select, assetPM{Asset portfolio management} account{Account} outdebtinfo{Outstanding debt information} netassets{Net assets} cash{Cash} securities{Securities} totalactualassets{Total actual assets} actualnetassets{Actual net assets} availablecash{Available cash} totaldebt{Total debt} rttRatio{RTT RATIO} other{}}
vi: {assetPageForm,select, assetPM{Danh mục tài sản} account{Tài khoản} outdebtinfo{Thông tin dư nợ} netassets{Tổng tài sản ròng thực tế} cash{Tiền mặt} securities{Chứng khoán} totalactualassets{Tổng tài sản thực tế} actualnetassets{TSR thực tế} availablecash{Tiền mặt có thể rút} totaldebt{Tổng nợ} rttRatio{TỶ LỆ RTT} other{}}

# assetGeneralForm
source: {assetGeneralForm, select, assetInfo{Asset infomation} totalactualassets{Total actual assets} realnetassets{Real net assets} basicbuyingpower{Basic buying power} casha4w{Cash available for withdrawal} cash{Cash} heldstockvalue{Held stock value} totalPA{Total pledged assets} accountlimit{Account limit} asf{Available selling funds} pevs{Pending exercise value of stocks} npa{Net pledged assets} percentgainloss{% Gain/Loss} dividend{Dividend} SNAFL{Stock not available for loan} totaldebt{Total debt} rttRatio{RTT ratio} lockedfunds{Locked funds} SAFL{Stock available for loan} principaldebt{Principal debt} ANFS{Amount needed for supplementation} buypending{Buy pending} totalcapitalvalue{Total capital value} interestdebt{Interest debt} accountstatus{Account status} BWTD{Buy within the day} gainloss{Gain/Loss} feedebt{Fee debt} other{}}
vi: {assetGeneralForm, select, assetInfo{Thông tin tài sản} totalactualassets{Tổng tài sản thực tế} realnetassets{Tài sản ròng thực tế} basicbuyingpower{Sức mua cơ bản} casha4w{Tiền mặt có thể rút} cash{Tiền mặt} heldstockvalue{Giá trị CK nắm giữ} totalPA{Tổng tài sản ký quỹ} accountlimit{Hạn mức tài khoản} asf{Tiền bán có thể ứng} pevs{Giá trị CK chờ THQ} npa{Tài sản ròng ký quỹ} percentgainloss{% Lãi/lỗ} dividend{Cổ tức} SNAFL{Chứng khoán không cho vay} totaldebt{Tổng nợ} rttRatio{Tỉ lệ RTT} lockedfunds{Tiền phong tỏa} SAFL{CK cho vay} principaldebt{Nợ gốc} ANFS{Số tiền cần bổ sung} buypending{Mua chờ khớp} totalcapitalvalue{Tổng giá trị vốn} interestdebt{Nợ lãi} accountstatus{Trạng thái tài khoản} BWTD{Mua trong ngày} gainloss{Lãi/lỗ} feedebt{Nợ phí LK} other{}}

# assetMoneyForm
source: {assetMoneyForm,select, accountbalance{Account balance} moneystate{Money statement} buyingPower{Buying power} cash{Cash} casha4w{Cash available for withdrawal} lockedfunds{Locked funds} asf{Available selling funds} mps{Money Pending settlement} dividend{Dividend} buypending{Buy pending} pfss{Proceeds from selling securities} feedebt{Fee debt} other{}}
vi: {assetMoneyForm,select, accountbalance{Thông tin số dư tiền} moneystate{Sao kê tiền} buyingPower{Sức mua} cash{Tiền mặt} casha4w{Tiền mặt có thể rút} lockedfunds{Số tiền phong tỏa} asf{Tiền bán có thể ứng} mps{Tiền chờ về} dividend{Cổ tức} buypending{Mua chờ khớp} pfss{Tiền bán CK} feedebt{Nợ phí LK} other{}}

# assetStockForm
source: {assetStockForm,select, securitiesBalance{Securities balance} gainlossDaily{Daily profit/loss} stockstate{Stock statements} gainlossPort{Portfolio profit/loss} rPorL{Realized profit or loss} directInfo{Directory information} sellmulcode{Sell multiple codes} symbol{Symbol} market{Market} costprice{Cost price} price{Price} availablevol{Available vol} gainloss{Gain/loss} capitalvalue{Capital value} marketvalue{Market value} totalvol{Total vol} shareUnA{Share UnAvailable} buypending{Buy pending} other{}}
vi: {assetStockForm,select, securitiesBalance{Thông tin số dư chứng khoán} gainlossDaily{Lãi/lỗ trong ngày} stockstate{Sao kê chứng khoán} gainlossPort{Lãi/lỗ danh mục} rPorL{Lãi lỗ đã thực hiện} directInfo{Thông tin danh mục} sellmulcode{Bán nhiều mã} symbol{Mã CK} market{Sàn} costprice{Giá vốn} price{Giá TT} availablevol{KL khả dụng} gainloss{Lãi/lỗ} capitalvalue{Giá trị vốn} marketvalue{Giá trị TT} totalvol{Tổng KL} shareUnA{Không khả dụng} buypending{KL mua chờ về} other{}}

# expandForm
source: {expandForm, select, expand{Expand} moneyTrans{Money Transactions} transferStock{Transfer Securities} rightTrading{Rights Trading} termdeposit{Term Deposit} settings{Settings} smartotp{Smart OTP} search{Search features} other{}}
vi: {expandForm, select, expand{Mở rộng} moneyTrans{Giao dịch tiền} transferStock{Chuyển chứng khoán} rightTrading{Giao dịch quyền} termdeposit{Tiền gửi có kỳ hạn} settings{Cài đặt} smartotp{Smart OTP} search{Tìm kiếm tính năng} other{}}

# expandList1Form
source: {expandList1Form, select, dmiaa{Deposit money into account} laba{Linking a bank account} tmtb{Transfer money to bank} imt{Internal money transfer} ba{Beneficiary account} cr{Money transfer history} other{}}
vi: {expandList1Form, select, dmiaa{Nộp tiền vào tài khoản} laba{Liên kết TKNH} tmtb{Chuyển tiền ra NH} imt{Chuyển tiền nội bộ} ba{Tài khoản thụ hưởng} cr{Lịch sử chuyển tiền} other{}}

# expandList2Form
source: {expandList2Form, select, ts{Transfer securities} sth{Stock transfer history} other{}}
vi: {expandList2Form, select, ts{Chuyển chứng khoán} sth{Lịch sử chuyển CK} other{}}

# expandList3Form
source: {expandList3Form, select, lup{Look up permissions} ryrtb{Register your right to buy} other{}}
vi: {expandList3Form, select, lup{Tra cứu quyền} ryrtb{Đăng ký quyền mua} other{}}

# expandList4Form
source: {expandList4Form, select, pb{Partner bank} luir{Look up interest rates} madr{Make a deposit request} lod{List of deposits} other{}}
vi: {expandList4Form, select, pb{Ngân hàng đối tác} luir{Tra cứu lãi suất} madr{Lập yêu cầu gửi tiền} lod{Danh sách khoản gửi tiền} other{}}

# expandList5Form
source: {expandList5Form, select, language{Language} bs{Biometric security} clp{Change login password} ctp{Change transaction password} lw{Loss warning} smss{Sms settings} pi{Personal information} dsi{Digital signature information} other{}}
vi: {expandList5Form, select, language{Ngôn ngữ} bs{Bảo mật sinh trắc học} clp{Đổi mật khẩu đăng nhập} ctp{Đổi mật khẩu giao dịch} lw{Cảnh báo lãi lỗ} smss{Cài đặt sms} pi{Thông tin tài khoản} dsi{Thông tin ký số} other{}}

# expandList6Form
source: {expandList6Form, select, rso{Register Smart OTP} go{Get OTP} do{Delivery OTP} cso{Change Smart OTP} fso{Forgot Smart OTP} other{}}
vi: {expandList6Form, select, rso{Đăng ký Smart OTP} go{Lấy mã OTP} do{Phương thức nhận OTP} cso{Đổi Smart OTP} fso{Quên Smart OTP} other{}}

# transferMoneyToBank
source: {transferMoneyToBank, select, tmtb{Transfer money to bank} senderInfo{Sender information} sendAccount{Sending account} aaft{Amount available for transfer} recInfo{Recipient information} recvAccount{Receiving account} recvBank{Receiving bank} recName{Recipient name} transAmount{Transfer amount} transFee{Transaction fee} transDes{Transfer description} totalAmount{Total amount} fromAccount{From account} toAccount{To account} other{}}
vi: {transferMoneyToBank, select, tmtb{Chuyển tiền ra ngân hàng} senderInfo{Thông tin người chuyển} sendAccount{Tài khoản chuyển} aaft{Số tiền có thể chuyển} recInfo{Thông tin người nhận} recvAccount{Tài khoản nhận} recvBank{Ngân hàng nhận} recName{Tên người nhận} transAmount{Số tiền chuyển} transFee{Phí giao dịch} transDes{Nội dung chuyển tiền} totalAmount{Tổng tiền} fromAccount{Từ tài khoản} toAccount{Đến tài khoản} other{}}

# transferMoneyIn
source: {transferMoneyIn, select, iMT{Internal money transfer} senderInfo{Sender information} sendAccount{Sending account} aaft{Amount available for transfer} recInfo{Recipient information} recvAccount{Receiving account} recName{Recipient name} transAmount{Transfer amount} transDes{Transfer description} transFee{Transaction fee} totalAmount{Total amount} fromAccount{From account} toAccount{To account} other{}}
vi: {transferMoneyIn, select, iMT{Chuyển tiền nội bộ} senderInfo{Thông tin người chuyển} sendAccount{Tài khoản chuyển} aaft{Số tiền có thể chuyển} recInfo{Thông tin tài khoản người nhận} recvAccount{Tài khoản nhận} recName{Tên người nhận} transAmount{Số tiền chuyển} transDes{Nội dung chuyển tiền} transFee{Phí giao dịch} totalAmount{Tổng tiền} fromAccount{Từ tài khoản} toAccount{Đến tài khoản} other{}}

# beneficAccount
source: {beneficAccount, select, benefAccount{Beneficiary account} LORA{List of receiving accounts} addBenAcc{Add beneficiary account} banks{Banks} account{Account} AHFN{Account holder's full name} other{}}
vi: {beneficAccount, select, benefAccount{Tài khoản thụ hưởng} LORA{Danh sách tài khoản thụ hưởng} addBenAcc{Thêm tài khoản thụ hưởng} banks{Ngân hàng} account{Tài khoản} AHFN{Họ và tên chủ tài khoản} other{}}

# lookUpPermission
source: {lookUpPermission, select, lookUpPer{Look up permissions} bank{Bank} TOR{Type of rights} status{Status} rightInfo{Right information} ER{Execution ratio} EED{Expected execution date} seeDetail{See details} rightDetail{Right detail} QORD{Quantity on record date} closeDate{Close date} other{}}
vi: {lookUpPermission, select, lookUpPer{Tra cứu quyền} bank{Ngân hàng} TOR{Loại quyền} status{Trạng thái} rightInfo{Thông tin quyền} ER{Tỉ lệ thực hiện} EED{Ngày thực hiện dự kiến} seeDetail{Xem chi tiết} rightDetail{Chi tiết quyền} QORD{Số lượng tại ngày chốt} closeDate{Ngày chốt quyền} other{}}

# partnerBanks
source: {partnerBanks, select, title{Partner bank} deposit{Deposit} depositpolicy{Deposit policy} download{Download} other{}}
vi: {partnerBanks, select, title{Ngân hàng đối tác} deposit{Gửi tiền} depositpolicy{Chính sách gửi tiền} download{Tải xuống} other{}}

# searchInterestRate
source: {searchInterestRate, select, title{Interest rate inquiry} bank{Bank} term{Term} interestRate{Interest rate} preInterestRate{Pre-maturity interest rate} deposit{Deposit} other{}}
vi: {searchInterestRate, select, title{Tra cứu lãi suất} bank{Ngân hàng} term{Kỳ hạn} interestRate{Lãi suất} preInterestRate{Lãi suất trước hạn} deposit{Gửi tiền} other{}}

# requestSendMoney
source: {requestSendMoney, select, title{Make a deposit request} account{Account} custName{Customer name} balance{Account balance} min{Minimum deposit amount} max{Maximum deposit amount} sendbank{Sending bank} bank{Bank} depositamount{Deposit Amount} daterequest{Request creation date} depositterm{Deposit term} interestRate{Interest rate} preInterestRate{Pre-maturity interest rate} renewal{Renewal method} maturitydate{Maturity date} receiveAccount{Principal and interest receiving account} other{}}
vi: {requestSendMoney, select, title{Lập yêu cầu gửi tiền} account{Tài khoản} custName{Tên khách hàng} balance{Số dư tiền} min{Số tiền gửi tối thiểu} max{Số tiền gửi tối đa} sendbank{Ngân hàng gửi} bank{Ngân hàng} depositamount{Số tiền gửi} daterequest{Ngày lập yêu cầu} depositterm{Kỳ hạn gửi} interestRate{Lãi suất} preInterestRate{Lãi suất trước hạn} renewal{Hình thức tái tục} maturitydate{Ngày đáo hạn} receiveAccount{Tài khoản nhận gốc và lãi} other{}}

# listSendMoney
source: {listSendMoney, select, title{List of deposits} bank{Bank} depositamount{Deposit amount} title2{Deposit details} account{Account} accountdetail{Account detail} interest{Interest} interestRate{Interest rate} term{Term} renewal{Renewal method} maturitydate{Maturity date} renewalNumber{Renewal number} status{Status} other{}}
vi: {listSendMoney, select, title{Danh sách khoản tiền gửi} bank{Ngân hàng} status{Trạng thái} depositamount{Số tiền gửi} title2{Chi tiết khoản gửi} account{Tài khoản} maturitydate{Ngày đáo hạn} accountdetail{Chi tiết tài khoản} interest{Lãi} interestRate{Lãi suất} term{Kỳ hạn} renewal{Hình thức tái tục} renewalNumber{Lần tái tục thứ} other{}}

# biometricSecurity
source: {biometricSecurity, select, title{Biometric Security} note{Please enter your password to activate this function} account{Account} password{Password} other{}}
vi: {biometricSecurity, select, title{Bảo mật sinh trắc học} note{Quý khách vui lòng nhập mật khẩu để kích hoạt chức năng này} account{Số tài khoản} password{Mật khẩu} other{}}

# changeLoginPass
source: {changeLoginPass,select, title{Change login password} oldpass{Old password} newpass{New password} renewpass{Confirm new password} note{Note: } exception{The password must be 8-32 characters long, including uppercase letters, lowercase letters, numbers, and special characters. The new password must not be the same as the current password.} other{}}
vi: {changeLoginPass,select, title{Đổi mật khẩu đăng nhập} oldpass{Mật khẩu hiện tại} newpass{Mật khẩu mới} renewpass{Xác thực mật khẩu mới} note{Lưu ý: } exception{Mật khẩu phải từ 8-32 ký tự, bao gồm chữ hoa, chữ thường, số và ký tự đặc biệt. Mật khẩu mới không được trùng với mật khẩu hiện tại.} other{}}

# losswarning
source: {losswarning, select, title{Loss warning} choice1{Alert settings} choice2{Warning list} account{Account} applicabletype{Applicable type} stockcode{Stock code} profit{Profit} loss{Loss} other{}}
vi: {losswarning, select, title{Cảnh báo lãi lỗ} choice1{Cài đặt cảnh báo} choice2{Danh sách cảnh báo} account{Tài khoản} applicabletype{Loại áp dụng} stockcode{Mã chứng khoán} profit{Lãi} loss{Lỗ} other{}}

# smssetting
source: {smssetting,select, smssetting{SMS settings} msg{Receive SMS notifications sent to your registered phone number.} other{}}
vi: {smssetting,select, smssetting{Cài đặt SMS} msg{Nhận thông báo qua SMS được gửi về số điện thoại đã đăng ký của Quý khách.} other{}}

# accountForm
source: {accountForm,select, account{Account} cn{Customer name} op{ORN/Passport} id{Issued date} poi{Place of issue} address{Address} phone{Phone} mobile{Mobile} email{Email} ct{Customer type} branch{Branch} consultant{Consultant} is{Information status} other{}}
vi: {accountForm,select, account{Tài khoản} cn{Tên khách hàng} op{Số ĐKSH/Pasport} id{Ngày cấp} poi{Nơi cấp} address{Địa chỉ} phone{Điện thoại} mobile{Di động} email{Email} ct{Loại khách hàng} branch{Chi nhánh} consultant{Cán bộ tư vấn} is{Trạng thái thông tin} other{}}

# digitalSignature
source: {digitalSignature,select, title{Digital signature information} choice1{Register digital signature information} choice2{List of digital signature information} cust{Customer} frDate{From date} toDate{To date} provider{Provider} username{Username} loginpass{Login password} status{Status} description{Description} titleUpdate{Update digital signature information} other{}}
vi: {digitalSignature,select, title{Thông tin ký số} choice1{Đăng ký TT ký số} choice2{Danh sách TT ký số} cust{Khách hàng} frDate{Từ ngày} toDate{Đến ngày} provider{Đơn vị} username{Tên đăng nhập} loginpass{Mật khẩu đăng nhập} status{Trạng thái} description{Mô tả} titleUpdate{Sửa thông tin ký số} other{}}

source: Delivery OTP
vi: Phương thức nhận OTP

# buttonForm
source: {buttonForm, select, adjust{Adjust} confirm{Confirm} continue{Continue} cancel{Cancel} delete{Delete} update{Update} apply{Apply} save{Save} clearFilter{Clear filter} withdrawsMoney{Withdraw money} sendMoney{Send money} cancel2{Cancel} buyButton{Buy} sellButton{Sell} other{}}
vi: {buttonForm, select, adjust{Điều chỉnh} confirm{Xác nhận} continue{Tiếp tục} cancel{Hủy bỏ} delete{Xóa} update{Sửa} save{Lưu} apply{Áp dụng} clearFilter{Xóa bộ lọc} withdrawsMoney{Rút tiền} sendMoney{Gửi tiền} cancel2{Hủy} buyButton{Mua} sellButton{Bán} other{}}
